app/controllers/home_controller.rb

  def home
      @micrositios = Micrositio.all
      @eventos = Evento.all
      @actividades = Actividad.all
      @users = User.all
---
SELECT "micrositios".* FROM "micrositios"
SELECT "eventos".* FROM "eventos"
SELECT "users".* FROM "users"