app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", "12"]]
SELECT "micrositios".* FROM "micrositios"
---
  def show
    @location = Location.friendly.find(params[:id])
    @micrositios = Micrositio.all

INSERT INTO "locations" ("actividad_id", "created_at", "name", "slug", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["actividad_id", 3], ["created_at", Tue, 28 Oct 2014 21:58:58 UTC +00:00], ["name", "Monterrey, Mexico"], ["slug", "monterrey-mexico"], ["updated_at", Tue, 28 Oct 2014 21:58:58 UTC +00:00]]
---
  def create
    @location = Location.find_or_create_by(location_params)