app/views/locations/show.html.erb

SELECT "micrositios".* FROM "micrositios" WHERE "micrositios"."uid" = 189178067784248 LIMIT 1
SELECT 1 AS one FROM "micrositios" WHERE "micrositios"."uid" = 189178067784248 LIMIT 1
---
            <% fbplace['data'].each do |result| %>
                <% unless Micrositio.exists?(uid: result['id'])   %>